app/Controllers/DashboardAdminController.php

SELECT *
FROM `levels`
---
    public function userManageRead()
    {
        $adminModel = new AdminModel();
        $levelModel = new LevelModel(); // Model untuk tabel levels

        // Ambil level pengguna yang sedang login
        $currentUserLevel = session()->get('level_user_id'); // Pastikan Anda menyimpan level_user_id di session saat login

        // Ambil semua pengguna
        if ($currentUserLevel == 1) { // Jika admin
            $data['users'] = $adminModel->where('level_user_id', 2)->findAll(); // Ambil hanya user dengan level_user_id 2

        } else if ($currentUserLevel == 3) { // Jika superadmin
            $data['users'] = $adminModel->getAllRole(); // Ambil semua pengguna
        }

        // Ambil semua level untuk dropdown
        $data['levels'] = $levelModel->findAll();