app/Controllers/Home.php

SELECT *
FROM `products`
---
    public function index()
    {
        // Inisialisasi model
        $cartModel = new CartModel();
        // $productModel = new ProductModel();
        // $productImageModel = new ProductImageModel();

        $data['products'] = $this->productModel->findAll();

SELECT *
FROM `products`
---
    public function shop(){

        $data['products'] = $this->productModel->findAll();