app/Controllers/KeranjangController.php

SELECT *
FROM `carts`
WHERE `user_id` = '1'
SELECT *
FROM `products`
WHERE `products`.`id` = '2'
SELECT *
FROM `product_images`
WHERE `product_id` = '2'
 LIMIT 1
---
    public function keranjang()
    {
        $user = $this->adminModel->find(session()->get('user_id'));

        if (!$user) {
            return redirect()->to('/login')->with('error', 'User not found');
        }

        $userId = session()->get('user_id');
        $cartItems = $this->cartModel->where('user_id', $userId)->findAll();

        $completeCartItems = [];

        foreach ($cartItems as $cartItem) {
            $product = $this->productModel->find($cartItem['product_id']);

            if ($product) {
                $productImage = $this->productImageModel->where('product_id', $cartItem['product_id'])->first();

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---

            foreach ($products as $product) {
                $productId = $product['productId'];
                $productExists = $this->productModel->find($productId);

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
                // Debug: Log each product being processed
                log_message('debug', 'Processing product: ' . json_encode($product));

                $productData = $this->productModel->find($product['productId']);

INSERT INTO `transactions` (`user_id`, `product_id`, `quantity`, `total_price`, `status`, `order_date`, `bukti_tf`, `alamat_kirim`, `shipping_courier`, `province`, `city`, `shipping_cost`) VALUES ('1', '1', 3, 60000, 'Pending', '2024-12-29 11:16:23', '1735470983_10574a32880e1bac0624.png', 'khiu ugiug', 'tiki', 'Jawa Tengah', 'Klaten', '17000')
---
                ];

                // Simpan transaksi
                if (!$this->transactionModel->insert($transactionData + $testData)) {

DELETE FROM `carts`
WHERE `user_id` = '1'
AND `product_id` IN ('1')
---
                // Debug: Log cart deletion
                log_message('debug', 'Deleting cart items: ' . json_encode($productIdsToDelete));

                $this->cartModel->where('user_id', $userId)
                                ->whereIn('product_id', $productIdsToDelete)
                                ->delete();