app/Controllers/LoginUsers.php

SELECT *
FROM `carts`
WHERE `user_id` = '1'
---
    public function profile()
    {
        // KONFIGURASI LOGIN

        // Pastikan user sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Ambil data user dari database
        $user = $this->adminModel->find(session()->get('user_id'));

        if (!$user) {
            return redirect()->to('/login')->with('error', 'User not found');
        }

        // Kirim data user ke view
        $data['user'] = $user;


        //AKSES DAN PENGGUNAAN DATA
        // Inisialisasi model
        $cartModel = new CartModel();
        $productModel = new ProductModel();
        $productImageModel = new ProductImageModel();

        // Ambil user ID dari session (misal)
        $userId = session()->get('user_id');

        // Ambil data keranjang untuk user yang sedang login
        $cartItems = $cartModel->where('user_id', $userId)->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = '2'
SELECT *
FROM `product_images`
WHERE `product_id` = '2'
 LIMIT 1
---

        foreach ($cartItems as $cartItem) {
            // Ambil data produk berdasarkan product_id dari cart
            $product = $productModel->find($cartItem['product_id']);

            // Ambil satu gambar produk berdasarkan product_id
            $productImage = $productImageModel->where('product_id', $cartItem['product_id'])->first();