app/Controllers/ProductController.php

    public function index()
    {
        $data['products'] = $this->productModel->findAll();
---
SELECT *
FROM `products`

    public function getImages($productId)
    {
        $images = $this->productImageModel->where('product_id', $productId)->findAll();
---
SELECT *
FROM `product_images`
WHERE `product_id` = '3'