app/Controllers/TransactionController.php

    public function index()
{
    // Load models
    $this->transactionModel = new TransactionModel();
    $this->adminModel = new AdminModel();
    $this->productModel = new ProductModel();

    // Get transactions, users, and products data
    $transactions = $this->transactionModel->getTransactionsWithDetails();
    $users = $this->adminModel->findAll();  // Mengambil semua pengguna dari tabel users
    $products = $this->productModel->findAll();  // Mengambil semua produk dari tabel products
---
SELECT *
FROM `products`