app/Models/TransactionModel.php

SELECT `transactions`.*, `users`.`username`, `users`.`email`, `products`.`name`
FROM `transactions`
JOIN `users` ON `users`.`id` = `transactions`.`user_id`
JOIN `products` ON `products`.`id` = `transactions`.`product_id`
---
    public function getTransactionsWithDetails()
    {
        return $this->db->table('transactions')
            ->select('transactions.*, users.username, users.email, products.name')
            ->join('users', 'users.id = transactions.user_id')
            ->join('products', 'products.id = transactions.product_id')
            ->get()
            ->getResultArray();